{
    "messages": [
        {
            "@type": "/cosmos.distribution.v1beta1.MsgCommunityPoolSpend",
            "authority": "chihuahua10d07y265gmmuvt4z0w9aw880jnsr700jeh7th3",
            "recipient": "chihuahua1gcdfar3d56l7wwd57ncqkygcmhpmpyxusfefj9",
            "amount": [
                {
                    "denom": "uhuahua",
                    "amount": "13500000000000"
                }
            ]
        }
    ],
    "metadata": "https://raw.githubusercontent.com/BitCannaGlobal/cosmospay-api/main/Interchain-proposals/huahua.json",
    "deposit": "1250000000000uhuahua",
    "title": "Integrate HUAHUA into Cosmos Pay",
    "summary": "Hello Chihuahua community! \n\n With this proposal we would like to test the waters for a community pool spend to integrate HUAHUA into Cosmos Pay. We have spoken with Chihuahua-leaders and based on their advice we are now writing this proposal. Let’s dive in!\n Cosmos Pay (commerce.bitcanna.io) is a payment integration for WooCommerce and Prestashop. It allows owners of e-commerce shops to accept Cosmos-based crypto assets, amongst which BCNA, ATOM and OSMO. The installation of the plugin is very easy. For Prestashop the guide can be found here (docs.bitcanna.io/v/bitcanna-commerce/get-started/integrating-with-prestashop) and for WooCommerce it is even integrated into the WordPress marketplace (wordpress.org/plugins/cosmos-pay/), making it a plug-and-play solution. An example of Cosmos Pay you can find on the Cosmos merch store (cosmosmerchstore.com). \n\n If this proposal passes we will do the following: \n- Integrate HUAHUA in Cosmos Pay\n- Test the integration together with the team \n- Deploy on the live version of Cosmos Pay for both WooCommerce and Prestashop\n- Maintain Cosmos Pay for the remainder of its lifecycle It is a one-time fee, after which we will do the required maintenance for the future without costs involved!\n\n For the integration we ask a one-time fee of $5000 (so 13.5 million HUAHUA against current prices (note; this might be subject to the change in token value when the proposal goes on-chain)). These funds will be slowly liquidated over time to avoid hurting the price of HUAHUA.\nSo, now our question is; do you support this proposal and community pool spend? \n- Yes (integrate Chihuahua) \n- No (don’t integrate Chihuahua) \n- No_with_veto (rubbish proposal, burn the deposit) \n- Abstain\n"
}
